In [3]:
import pandas as pd

# 0. Crear el set de datos para los departamentos
data = {
    'Departamento': ['Ventas', 'Ventas', 'TI', 'TI', 'RRHH', 'RRHH', 'Ventas', 'TI'],
    'Empleado': ['Ana', 'Luis', 'Carlos', 'Sofía', 'Elena', 'Pablo', 'Jorge', 'Marta'],
    'Puntuación': [85, 78, 92, 95, 60, 65, 88, 91]
}

df = pd.DataFrame(data)
df

  Departamento Empleado  Puntuación
0       Ventas      Ana          85
1       Ventas     Luis          78
2           TI   Carlos          92
3           TI    Sofía          95
4         RRHH    Elena          60
5         RRHH    Pablo          65
6       Ventas    Jorge          88
7           TI    Marta          91

In [4]:
#1. Agrupar rendimiento por departamento.
grouped_departamento = df.groupby('Departamento')
print (grouped_departamento)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002A0A6B4C590>

In [5]:
#2. Calcular promedio, mínimo y máximo de puntuación.
estadistica = grouped_departamento['Puntuación'].agg(['mean', 'min', 'max'])
estadistica

                   mean  min  max
Departamento
RRHH          62.500000   60   65
TI            92.666667   91   95
Ventas        83.666667   78   88

In [6]:
#3. Filtrar resultados mayores a un umbral.
umbral=85
mayores_a_85=df.groupby('Departamento').filter(lambda x: x['Puntuación'].mean() > umbral)
mayores_a_85

  Departamento Empleado  Puntuación
2           TI   Carlos          92
3           TI    Sofía          95
7           TI    Marta          91

In [7]:
#4. Ordenar de mayor a menor.
ordenado = estadistica.sort_values(by='mean', ascending=False)
ordenado

                   mean  min  max
Departamento
TI            92.666667   91   95
Ventas        83.666667   78   88
RRHH          62.500000   60   65

In [10]:
#5. Preparar reporte final listo para exportar a Excel.
reporte_final= ordenado.rename(columns=
{'mean':'Promedio Puntuación',
 'min':'Mínimo Puntuación',
 'max':'Máximo Puntuación'
 })
reporte_final

              Promedio Puntuación  Mínimo Puntuación  Máximo Puntuación
Departamento
TI                      92.666667                 91                 95
Ventas                  83.666667                 78                 88
RRHH                    62.500000                 60                 65